; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v3 - type_2 ?v5 - type_3)
 	      (pred_3 ?v7 - object ?v5 - type_3)
	      (pred_1 ?v3 - type_2 ?v1 - type_1)
	      (pred_2 ?v3 - type_2 ?v7 - object ?v1 - type_1))

   (:action op_1
       :parameters  (?v3 - type_2 ?v8 ?v2 - type_3)
       :precondition (and  (pred_4 ?v3 ?v8))
       :effect (and  (pred_4 ?v3 ?v2)
		     (not (pred_4 ?v3 ?v8))))

   (:action op_2
       :parameters (?v3 - type_2 ?v6 - object ?v4 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v6 ?v4) (pred_4 ?v3 ?v4) (pred_1 ?v3 ?v1))
       :effect (and (pred_2 ?v3 ?v6 ?v1)
		    (not (pred_3 ?v6 ?v4)) 
		    (not (pred_1 ?v3 ?v1))))

   (:action op_3
       :parameters (?v3 - type_2 ?v6 - object ?v4 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v6 ?v1) (pred_4 ?v3 ?v4))
       :effect (and (pred_3 ?v6 ?v4)
		    (pred_1 ?v3 ?v1)
		    (not (pred_2 ?v3 ?v6 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_09 - type_2
obj_01 obj_05 - type_1
obj_03 obj_08 obj_04 - type_3
obj_06 obj_02 obj_07 - object)
(:init
(pred_4 obj_09 obj_04)
(pred_1 obj_09 obj_01)
(pred_1 obj_09 obj_05)
(pred_3 obj_06 obj_04)
(pred_3 obj_02 obj_08)
(pred_3 obj_07 obj_03)
)
(:goal
(and
(pred_3 obj_06 obj_04)
(pred_3 obj_02 obj_08)
(pred_3 obj_07 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_09 ?b obj_05))))
)
)

; plan
1. (op_1 obj_09 obj_04 obj_03)
   deleted: (pred_4 obj_09 obj_04)
   added: (pred_4 obj_09 obj_03)
   goals met: 2 of 3
2. (op_2 obj_09 obj_07 obj_03 obj_01)
   deleted: (pred_3 obj_07 obj_03) (pred_1 obj_09 obj_01)
   added: (pred_2 obj_09 obj_07 obj_01)
   goals met: 2 of 3
3. (op_1 obj_09 obj_03 obj_04)
   deleted: (pred_4 obj_09 obj_03)
   added: (pred_4 obj_09 obj_04)
   goals met: 2 of 3
4. (op_3 obj_09 obj_07 obj_04 obj_01)
   deleted: (pred_2 obj_09 obj_07 obj_01)
   added: (pred_3 obj_07 obj_04) (pred_1 obj_09 obj_01)
   goals met: 3 of 3
